{
  "Язык": "Language",
  "Тема": "Theme",
  "Светлая": "Light",
  "Тёмная": "Dark",
  "Поленов Дмитрий": "Polenov Dmitry",
  "Главная": "Home",
  "Обо мне": "About Me",
  "Резюме": "Resume",
  "Портфолио": "Portfolio",
  "Контакты": "Contacts",
  "Добро пожаловать": "Welcome",
  "Меня зовут Дмитрий": "My name is Dmitry",
  "Я frontend-разработчик": "I'm a frontend developer",
  "Приветствую вас в моей вселенной!": "Welcome to my universe!",
  "Связаться": "Get in Touch",
  "Адрес": "Address",
  "Российская Федерация": "Russian Federation",
  "Как вас зовут?": "What is your name?",
  "Ваша электронная почта?": "Your email address?",
  "Текст сообщения": "The text of the message",
  "Отправить": "Send message",
  "Напишите мне": "Send me a not",
  "Соцсети": "Follow me",
  "Узнай меня лучше": "Know Me More",
  "Краткое описание": "Summary",
  "Мои проекты": "My Work",
  "Здравствуйте": "Hello",
  "Меня зовут": "My name is",
  "Владимирович": "Vladimirovich",
  "Я frontend-разработчик с глубоким интересом к созданию инновационных и эффективных веб-приложений": "I am a frontend developer with a deep interest in creating innovative and efficient web applications",
  "Стремлюсь к постоянному росту в сфере и готов к новым задачам": "I strive for constant growth in the field and am ready for new challenges",
  "Моя цель - создавать пользовательские интерфейсы, которые были бы не только красивыми, но и удобными для пользователя. Я следую передовым технологиям и методологиям разработки, чтобы обеспечить наилучшее качество и эффективность моих проектов": "My goal is to create user interfaces that are not only beautiful but also user-friendly. I follow advanced technologies and development methodologies to ensure the best quality and efficiency of my projects",
  "Имя": "Name",
  "Эл. почта": "Email",
  "Возраст": "Age",
  "Локация": "Location",
  "Скачать": "Download",
  "Опыт работы": "Work experience",
  "Инженер-программист": "Software Engineer",
  "ЧАО СНПО «Импульс»": "PJSC SRPA «Impulse»",
  "Функциональные обязанности": "Functional responsibilities",
  "программирование микроконтроллеров": "programming of microcontrollers",
  "разработка кроссплатформенных приложений на Qt": "development of cross-platform applications on Qt",
  "создание сервисов под ОС Linux на С++": "creating services for Linux in C++",
  "документирование разработанных программных продуктов": "documentation of developed software products",
  "Фриланс": "Freelance",
  "Навыки": "Skills",
  "Проект": "Project",
  "Описание": "Description",
  "Технологии": "Technologies",
  "Проект интерфейса популярной социальной сети. Реализованы следующие функции: отображение списка постов согласно БД, отображение информации каждого поста, поиск постов по хештегу, отображение видеоистории пользователя.": "The project of the interface of a popular social network. The following functions are implemented: displaying a list of posts according to the database, displaying information for each post, searching for posts by hashtag, displaying the user's video history.",
  "Проект лендинга по продаже ароматических свечей": "A landing page project for the sale of scented candles",
  "Проект для работы с постами. Реализованы следующие функции: постраничная навигация, взаимодействие с сервером, библиотека UI компонентов, регистрация/авторизация, создание/удаление постов, сортировка/поиск, слайдер, модальное окно, пагинация... Детальнее на странице <О сайте> проекта.": "A project for working with posts. The following functions are implemented: pagination, interaction with the server, library of UI components, registration/authorization, creation/deletion of posts, sorting/search, slider, modal window, pagination... For more information, see the <About site> page of the project.",
  "Проект для работы со статьями. Реализованы следующие функции: постраничная навигация, взаимодействие с сервером, регистрация/авторизация, создание/удаление/редактирование статей, сортировка, пагинация... Детальнее на странице <О сайте> проекта.": "A project for working with articles. The following functions are implemented: pagination, interaction with the server, registration/authorization, creation/deletion/editing of articles, sorting, pagination... For more information, see the <About site> page of the project.",
  "Проект интернет-магазина детских игрушек. Реализованы следующие функции: постраничная навигация, взаимодействие с сервером, регистрация/авторизация, работа с БД товаров, сортировка/фильтрация/поиск товаров, создание комментариев, корзина товаров, пагинация... Детальнее на странице <О сайте> проекта.": "The project of an online store for children's toys. The following functions are implemented: page-by-page navigation, interaction with the server, registration/authorization, working with the product database, sorting/filtering/searching for products, creating comments, shopping cart, pagination... For more information, see the <About site> page of the project.",
  "Проект сайта-портфолио фронтенд-разработчика": "Website project-portfolio of a frontend developer",
  "Фронтенд-разработчик": "Frontend Developer",
  "разработка и поддержка одностраничных приложений на React, обеспечивая высокую производительность и отзывчивость": "development and support of single-page applications on React, providing high performance and responsiveness",
  "использование React Hooks и контекста для управления состоянием компонентов": "using React Hooks and context to manage the state of components",
  "интеграция с внешними API для получения и отправки данных с использованием библиотеки Axios": "integration with external APIs for receiving and sending data using the Axios library",
  "работа с Redux для эффективного управления глобальным состоянием приложения": "working with Redux to effectively manage the global state of the application",
  "оптимизация приложений для различных устройств и браузеров, обеспечивая кроссбраузерную совместимость": "optimize applications for different devices and browsers, ensuring cross-browser compatibility",
  "тестирование компонентов с использованием Jest для обеспечения стабильности кода": "testing components using Jest to ensure code stability"
}
